[
    {
        "id": 1,
        "title": "HallPoint",
        "description": "HallPoint is a hostel management system for students’ meals and activities, with admin oversight.",
        "briefDescription": "HallPoint streamlines hostel operations by enabling students to manage their meal memberships effortlessly, including purchasing and upgrading options. The system features comprehensive dashboards tailored for students and administrators, offering real-time tracking of meal requests, upcoming meal schedules, and user activities. This centralized platform enhances communication, simplifies meal management, and improves the overall hostel experience for everyone involved.",
        "image": "/projects/hallpoint.png",
        "links": {
            "live": "https://hall-point.web.app/",
            "client": "https://github.com/mdmhrz/hall-point-client",
            "server": "https://github.com/mdmhrz/hall-point-server"
        },
        "tech": [
            "React",
            "Express.js",
            "MongoDB",
            "TailwindCSS",
            "JWT",
            "DaisyUI",
            "Node.js",
            "TanStack Query",
            "Firebase",
            "Stripe",
            "React Router",
            "React Hook Form",
            "Framer Motion",
            "React Icons",
            "Axios",
            "Day.js",
            "Lottie React",
            "SweetAlert2",
            "Swiper",
            "ESLint",
            "Vite"
        ],
        "challenges": [
            "Implementing JWT authentication using HTTP-only cookies, which caused issues in production.",
            "Handling deployment complexities and configuration on Vercel.",
            "Fetching and aggregating dashboard data efficiently using MongoDB aggregation pipelines.",
            "Implementing fast and accurate search functionality using MongoDB indexing."
        ],
        "potentialImprovements": [
            "Add mobile app support for easier access on the go.",
            "Implement automated notifications and reminders via email or SMS.",
            "Improve analytics dashboard with more granular user activity tracking."
        ],
        "futurePlans": [
            "Integrate advanced meal customization options for users.",
            "Add multilingual support for wider accessibility.",
            "Implement offline mode to allow data caching during poor network connectivity."
        ]
    },
    {
        "id": 2,
        "title": "AltPick",
        "description": "AltPick is a community platform for sharing, voting, and discovering trusted product recommendations.",
        "briefDescription": "AltPick is a collaborative product recommendation platform designed to connect users seeking advice with a community of contributors. Users can post product queries, receive tailored recommendations, and vote on the best suggestions. The platform promotes engagement through a transparent voting system, fostering trust and credibility in shared recommendations. With an intuitive interface and real-time updates, AltPick makes discovering the right products faster, easier, and more reliable.",
        "image": "/projects/altpick.png",
        "links": {
            "live": "https://altpick-b57eb.web.app/",
            "client": "https://github.com/mdmhrz/alt-pick-client",
            "server": "https://github.com/mdmhrz/alt-pick-server"
        },
        "tech": [
            "React",
            "Express.js",
            "MongoDB",
            "Firebase",
            "TailwindCSS",
            "Firebase Admin",
            "React Router",
            "Node.js",
            "DaisyUI",
            "Axios",
            "Framer Motion",
            "Lottie React",
            "React Helmet",
            "React Toastify",
            "SweetAlert2",
            "Swiper",
            "ESLint",
            "Vite",
            "Nodemon",
            "Dotenv",
            "CORS",
            "Date-fns"
        ],
        "challenges": [
            "Managing recommendation count updates (increment and decrement) when a recommendation is added or deleted.",
            "Implementing JWT authentication using Firebase token validation.",
            "Handling scalability of MongoDB queries for large datasets.",
            "Ensuring seamless integration of third-party libraries like Swiper and Lottie."
        ],
        "potentialImprovements": [
            "Add personalized recommendation algorithms based on user preferences.",
            "Implement social sharing options to increase community engagement.",
            "Enhance UI accessibility and responsiveness on smaller devices."
        ],
        "futurePlans": [
            "Introduce a mobile app version to boost user interaction.",
            "Add API endpoints for external integrations and third-party apps.",
            "Expand voting system to include weighted votes and badges."
        ]
    },
    {
        "id": 3,
        "title": "JobTrack",
        "description": "JobTrack helps users track job applications, monitor progress, and access insights via a simple dashboard.",
        "briefDescription": "JobTrack is a job application tracking system designed to keep users organized throughout their career search. It allows users to log and categorize applications, monitor their progress, and view detailed analytics on application trends. With a responsive interface, smooth animations, and an integrated admin panel, JobTrack provides both job seekers and administrators with valuable insights, helping streamline the job-hunting process and improve decision-making.",
        "image": "/projects/jobtrack.png",
        "links": {
            "live": "https://job-track-53365.web.app/",
            "client": "https://github.com/mdmhrz/job-track"
        },
        "tech": [
            "React",
            "React Router",
            "TailwindCSS",
            "Framer Motion",
            "DaisyUI",
            "React Icons",
            "Firebase",
            "React Helmet Async",
            "React Toastify",
            "React Intersection Observer",
            "React Scroll",
            "React CountUp",
            "ESLint",
            "Vite"
        ],
        "challenges": [
            "Implementing smooth animations and transitions without impacting performance.",
            "Ensuring reliable user authentication and data privacy with Firebase.",
            "Building an analytics dashboard that is both informative and easy to use.",
            "Maintaining consistent UI/UX across different browsers and devices."
        ],
        "potentialImprovements": [
            "Add advanced filtering and search capabilities for job listings.",
            "Integrate calendar reminders and notifications for upcoming deadlines.",
            "Expand admin panel features for more detailed reporting and user management."
        ],
        "futurePlans": [
            "Develop a mobile app for iOS and Android platforms.",
            "Implement AI-powered job matching and recommendation system.",
            "Add multi-language support for international users."
        ]
    }
]